<!DOCTYPE html>
<html>
<head>
<meta charset="ISO-8859-1">
<title>Dokumentation f&uuml;r Importit21</title>
</head>
<body>
<a href="Aenderungshistory.html">Versionshistorie</a><br>
<h1>Dokumentation f&uuml;r Importit21</h1>

Das Infosystem IMPORTIT21 dient zum Import von Daten die als Exceldatei im Format .xls oder .xlsx vorliegen.


<h2>Genereller Ablauf</h2>

<p>Die zu importierenden Daten werden in einer formatierten Excel Datei in
der Samba Freigabe des Mandanten abgelegt.<br>
z.b. win/tmp/
</p>

<ol>
<li><h3>Das Passwort f&uuml;r den Mandanten eingeben</h3><br>
<br> 
<img src="password.jpg">
<br>
<li><h3>Datei eintragen</h3>
Im Infosystem nun den Pfad und Dateinamen der ExcelDatei im Feld
"Import Excel File" eintragen.<br>
z.B.: win/tmp/part.xlsx<br><br>
<img src="file.jpg"></li>
<br>
<li><h3>Struktur pr&uuml;fen</h3><br>
Es wird die folgenden Angaben in der Excel-Datei gepr&uuml;ft:
<ul>
  <li>Gibt es die Datenbank bzw. das Tipkomanndo</li>
  <li>Pr&uuml;fung der Variablen, ob Sie in der Datenbank vorhanden sind</li>
</ul> 
Es werden alle relevanten Zeilen der Excel-Datei eingelesen
</li>
<br>
<li><h3>Daten pr&uuml;fen</h3><br>
Es werden die einzelnen Daten aus der Excel-Tabelle auf die folgenden Punkte gepr&uuml;ft:
<ul>
	<li>Bei Verweisfeldern wird gepr&uuml;ft, ob die &uuml;bergebenen Werte in der entsprechenden Datenbank vorhanden ist.
	<li>Bei den Multiverweisfeldern wird das gleiche wie den Verweisfeldern gepr&uuml;ft. Allerdings ist es derzeit nur f&uuml;r den Typ VPK1 umgesetzt.
	<li>Bei den Textfeldern wird gepr&uuml;ft, ob der &uuml;bergabewert mit seiner L&uuml;nge in das entsprechende Feld passt.
	<li>Integer-Felder werden auf die richtige Anzahl Vorkommastellen gepr&uuml;ft.
	<li>Real-Felder werden auf die richtige Anzahl von Vor- und Nachkommastellen gepr&uuml;ft.
	<li>Datum-Felder werden gepr&uuml;ft, ob der Wert in ein Abas-Datum gewandelt werden kann.
	<li>Zeitraum-Felder werden gepr&uuml;ft, ob der Wert in eine Abas-Zeitraum gewandelt werden kann. 
</ul>
<br>
<li><h3>Daten importieren</h3><br> 
Beim Import der Daten werden im Neu bzw. Update-Modus die einzelnen Datens&uuml;tze in die Datenbank geschrieben.
</ol>
 
<li><h2>Aufbau der Import-Datei</h2>
<p>!! Achtung es wird nur die erste Tabelle des Excel-Sheet ausgewertet.</p>
<p>!! Es muss das erste Feld einer Zeile gef&uuml;llt sein, ansonsten sieht Importit diese Zeile als leer an.</p>  
	<img src="excelaufbau.jpg">
<br>
<h3><b>Feldbeschreibungen</b></h3>
<ol>
<li><h4>Datenbank:Gruppe</h4><br>
	In dem Feld "Datenbank:Gruppe" (Feld 1:A) wird die Datenbank mit der entsprechenden Gruppe angegeben.<br>
	z.B.: "Teil:Artikel" oder "2:1"
	Alternativ kann auch das Tipp-Kommando als Nummer angegeben werden.<br>
	Dieses Feld in Excel bitte als Text-Feld formatieren.
</li>
<li><h4>Tabelle ab Spalte</h4>
</li>In diesem Feld wird angegeben,ab welcher Spalte Tabelledaten vorhanden sind.<br>
	 Die Z&uuml;hlung beginnt hierbei ab 1. Ist also in der Spalte "E" der erste Wert f&uuml;r<br>
	 ein Tabellenfeld vorhanden, so wird diese Zelle mit 5 beschrieben. Sind keine<br>
	 Tabellenfelder zu importieren, so mu&uuml; das Feld mit 0 beschrieben werden.<br>
<li><h4>Optionscode</h4></li>
	In Zeile1/Spalte C kann ein Optionscode angegeben werden. Dieser belegt die<br>
	Importoptionen des Infosystems vor. Die verschiedenen Optionen werden unten beschrieben.<br>
<li><h4>SML-Sachmerkmalsleiste</h4></li>
    Wenn Daten f&uuml;r eine Sachmerkmalsleiste eingelesen werden sollen, 
    muss hier die Nummer der Sachmerkmalsleiste eingetragen werden.
	
<li><h4>Feldnamen</h4></li>	
	In Zeile2 ab SpalteB werden die Feldnamen der abas Felder darunterfolgenden<br>
	Daten deklariert. Das hei&uuml;t diese Zeile ist zugleich die Schl&uuml;sselung der<br>
	Daten zu abas Feldern und zugleich stellt Sie die Reihenfolge des Datenimports<br>
	dar.
<li><h4>Feldname@feldoption</h4></li>
	An den Feldnamen kann eine Feldoption angef&uuml;gt werden.<br>
	Diese Optionen ver&uuml;ndern das Verhalten beim Schreiben dieses Feldes.<br>
	Folgende Feldoptionen sind verf&uuml;gbar:<br>
	<ol>
	<li>@notempty:<br>
		Wenn diese Option an den Feldnamen angeh&uuml;ngt ist, wird zuerst gepr&uuml;ft, ob der zu schreibende Wert leer ist.<br>
		Wenn Wert leer ist, wird kein Wert in dieses Feld geschrieben. <br>
		Damit kann man das unbeabsichtigte l&uuml;schen von Feldern verhindern. <br>  
	<li>@modifiable:<br>
		Wenn die Option "@modifiable" gesetzt wird, wird vor dem Beschreiben des Feldes gepr&uuml;ft, ob das Feld beschreibbar ist.<br>
		Ist das Feld nicht beschreibbar, kommt es ohne diese Option zum Fehler beim Schreiben des Datensatzes <br>
	<li>@skip:<br>
		Ist die Option "@skip" angegeben wird die komplette Spalte ignoriert.<br>
	<li>@Schl&uuml;ssel:<br>
		&uuml;ber den hier definierten Feldnamen wird in der Datenbank<br>
		nach einem schon existierenden Datensatz gesucht. Mit "@" kann f&uuml;r diese<br>
		Datenselektion ein Schl&uuml;ssel mitgegeben werden.<br>
    <li>@dontChangeIfEqual:	  <br>
		Mit der Option "@dontChangeIfEqual" wird f&uuml;r die markierten Felder das Verhalten des STORE-MODUS simuliert.<br>
		Wenn das zu beschreibende Feld, den gleichen Inhalt hat wie der zu schreibende Wert, wird das Feld nicht neu beschrieben.<br> 
	<li>@selection:     <br>
        Mit der Option "@selection" kann f&uuml;r ein zu beschreibendes Verweis-Feld eine Selektion angeben werden. <br>
        Syntax:  <feldname>@selection='<Selektionsausdruck>' <br>
        Bei dem Selektionsausdruck kann ein Wert durch den Ausdruck {0} mit dem Wert aus dem Feld ersetzt werden.<br>  
        Beispiel: Feld staat im Kunde : staat@selection='$,,iso3={0}'     im Feld steht DEU , <br>
        daraus ergibt sich eine Selektion  $,,iso3=DEU 
        
        Die die Sprache der Variablen wird &uuml;ber die Steuerung der Variablensprache im Infosystem gesteuert. 
        Das heisst, wenn englische Variablensprache dann muss der Ausdruck oben stateOfTaxOffice@selection='$,,ctryCode3Char={0}' hei&szlig;en.

	<li>@keyselection:      <br>
        Mit der Option "@keyselection" wird f&uuml;r die Selektion des Datensatzes eine selbstdefinierte Selektion verwendet<br>
        Syntax @keyselection='<Selektionsausdruck>'
        Beispiel: @keyselection='$,,alteIdent={0}' 
	</ol>
	<li><h4>Wert1 - Daten:</h4>
	Ab der 3.Zeile werden die Daten eingetragen. Die Daten m&uuml;ssen abas konform<br>
	vorhanden sein. Ein "." in einem Datumsfeld bewirkt also den Eintrag des<br>
	Tagesdatums im Datensatz in abas-ERP. Wird ein Datum mit 4 stelliger Jahreszahl<br>
	dargestellt, in abas ist das Datenfeld aber mit 2-stelliger Jahreszahl definiert<br>
	so scheitert der Import. Mehrzeilige Texte werden abas konform behandelt, das hei&szlig;t<br>
	ein Zeilenvorschub wird mit ";" im Text erreicht.<br>
	</li>
</ol>
<h3>Importoptionen</h3>
&uuml;ber die Importoptionen kann der Importprozess gesteuert werden.<br> 
Diese Optionen gelten f&uuml;r alle Felder und alle Datens&uuml;tze.<br>
F&uuml;r die verschiedenen ausgew&uuml;hlten Optionen wird ein Optionscode ermittelt,<br>
dieser kann in die ExcelTabelle eingetragen werden. <br>
<br>
<img src="optionen.jpg">
<ol>
	<li><h4>Datens&uuml;tze neu anlegen:</h4>
	Mit dieser Option wird keine Datenselektion vor dem<br>
	Import durchgef&uuml;hrt. Jeder Datensatz wird neu angelegt.<br></li>
	<li><h4>FOP deaktivieren:</h4>
	Beim Import werden  EFOPS in den Zielmasken ausgeschaltet.<br></li>
	<li><h4>Tabelle l&uuml;schen:</h4>
	Dieser Kenner bewirkt ein L&uuml;schen der Tabelle der betroffenen<br>
	Datens&uuml;tze bevor der Datenimport beginnt.<br></li>
	<li><h4>Feld Modifizierbarkeit pr&uuml;fen:</h4>
	Vor dem Beschreiben der Felder wird gepr&uuml;ft, ob das Feld &uuml;nderbar ist.<br>
	Wenn nicht wird das Feld ignoriert.
	</li>
	<li><h4>Englische Variablen:</h4>
	Wenn diese Option gesetzt ist, werden die englischen Variablenname ausgewertet. 
	</li>
	<li><h4>&uuml;ndere nicht, wenn gleicher Inhalt</h4>
	Mit dieser Option "@dontChangeIfEqual" wird f&uuml;r alle Felder das Verhalten des STORE-MODUS simuliert.<br>
	Wenn das zu beschreibende Feld, den gleichen Inhalt hat wie der zu schreibende Wert,<br> 
	wird das Feld nicht neu beschrieben.<br>
	
	</li>
</ol>
<h2>Fehleranzeige</h2>
Wenn bei der Verarbeitung ein Fehler auftritt, wird dieser in den Felder "Fehler in ..." angezeigt.
 <img src="fehler1.jpg">
&uuml;ber den Kenner "nur fehlerhafte Datens&uuml;tze anzeigen" und den Button "Daten in die Tabelle laden"<br> 
k&uuml;nnen die fehlerhaften Datens&uuml;tze in der Tabelle angezeigt werden.
&uuml;ber den Button Analyse kann das Fehlerprotokoll angezeigt werden.
<img src="fehler2.jpg">
<h2>sonstige Felder</h2>  
<img src="felder.jpg">
<ol>
<li><h4>Datenbank</h4>
Im Feld Datenbank wird die aus der Exceldatei gelesene Datenbank zur Kontrolle dargestellt.
</li>
<li><h4>Gruppe</h4>
In diesem Feld wird die aus der Exceldatei gelesene Datenbankgruppe<br>
zur Kontrolle dargestellt.
</li>
<li><h4><h4>Tippkommando</h4>
In diesem Feld wird das aus der Exceltabelle gelesene Tippkommando dargestellt.
</li>
<li><h4>Tabellendaten ab Spalte</h4>
In diesem Feld wird angezeigt ab welcher Spalte die Tabellenfelder beginnen.
</li>
<li><h4>Optionscode</h4>
In diesem Feld wird der durch die Auswahl der Optionen errechnete Optionscode angezeigt. 
</ol>
</body>
</html>